tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'nodenv/nodenv'
tap 'thoughtbot/formulae'

# Build tools and libs
brew 'coreutils'
brew 'gmp'
brew 'libyaml'
brew 'makedepend'
brew 'pkg-config'
brew 'readline'

brew 'ack'
brew 'antigen'
brew 'awscli'
brew 'chromedriver'
brew 'diff-so-fancy'
brew 'fasd'
brew 'gnu-tar'
brew 'heroku'
brew 'imagemagick'
brew 'node-build'
brew 'nodenv-aliases'
brew 'nodenv-vars'
brew 'nodenv'
brew 'openssl'
brew 'parity'
brew 'rbenv-aliases'
brew 'rbenv-default-gems'
brew 'rbenv-vars'
brew 'rbenv'
brew 'rcm'
brew 'ruby-build'
brew 'thefuck'
brew 'watch'
brew 'yarn'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'zsh'

brew 'elasticsearch'
brew 'elasticsearch@2.4'
brew 'mysql'
brew 'mysql@5.6'
brew 'postgresql'
brew 'postgis'
brew 'redis'

cask 'alfred'
cask 'atom'
cask 'captain'
cask 'dash'
cask 'docker'
cask 'gimp'
cask 'google-chrome'
cask 'harvest'
cask 'hyper'
cask 'iterm2'
cask 'java8'
cask 'kap'
cask 'keepingyouawake'
cask 'lastpass'
cask 'openoffice'
cask 'pgadmin4'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'teamspeak-client'
cask 'the-unarchiver'
cask 'tunnelblick'
cask 'vlc'
cask 'whatsapp'

# Quicklook plugins
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookapk'
